# 4. Задайте список из N элементов, заполненных числами из промежутка [-N, N].
#  Найдите произведение элементов на указанных позициях. 
#  Позиции хранятся в файле file.txt в одной строке одно число.

print("Введите количество элементов списка N: ")
N = int(input())

for i in range (-N, N + 1):
    

